[
    {
        "role":"Senior Infrastructure Architect",
        "company":"Prophecy Networks Ltd",
        "summary":"Senior management position with overall responsibility for architectural design and delivery of internal and customer platforms. Delivered architectural design into production within NZ-based mobile telco.",
        "range":"July 2016 - Present"
    },
    {
        "role":"Technical Account Manager - Infrastructure Services",
        "company":"Prophecy Networks Ltd",
        "summary":"Provide management and leadership for all Prophecy Networks group infrastructure that is used internally and provides services to customers.",
        "range":"February 2015 - July 2016"
    },
    {
        "role":"Infrastructure Manager",
        "company":"Prophecy Networks Ltd (incorporating SafeNZ Ltd)",
        "summary":"Management of systems, improvement to service delivery to both internal users and external customers through investing in processes, policies, and documentation.",
        "range":"October 2009 - February 2015"
    },
    {
        "role":"Senior Engineer",
        "company":"Prophecy Networks Ltd / SafeNZ Networks Ltd",
        "summary":"Provide engineering skills and support to a wide range of clients as well as platforms supporting ISP business.",
        "range":"January 2007 - October 2009"
    },
    {
        "role":"Chief Penguin",
        "company":"Funky Penguin Open Source Solutions CC (South Africa)",
        "summary":"Performed contracted consulting work specifically targeting Linux-based server platforms. Developed PHP/MySQL-based online portal for digital retrieval of monthly rates invoices for City of Ekurhuleni, delivered and managed virtualized server platform for Chas Everitt International Property Group.",
        "range":"January 2005 - December 2007"
    },
    {
        "role":"Live-in Boarding House Master",
        "company":"St Stithians College (South Africa)",
        "summary":"I was one of several house masters who lived in the boarding house, had rostered responsibilty to manage one of the boys boarding houses.",
        "range":"January 2005 - December 2007"
    },
    {
        "role":"IT Engineer",
        "company":"Lithotech Ltd (South Africa)",
        "summary":"Started as helpdesk engineer, ended up redesigning 13-site mail platform to use qmail-ldap cluster, managing 64k bandwith per site (yes!) with squid transparent proxy and sarg reports.",
        "range":"January 1999 - December 2004"
    }

]
